atomic_tasks_report.org
:PROPERTIES:
#+OPTIONS: toc:nil
#+LATEX_HEADER_EXTRA: \usepackage{amsmath}
#+LATEX_HEADER_EXTRA: \usepackage{braket}
#+LATEX_HEADER_EXTRA: \usepackage{mathrsfs}
#+LATEX_HEADER_EXTRA: \usepackage{marginnote}
#+LATEX_HEADER_EXTRA: \newcommand{\mn}[2]{\marginnote{\tiny \textbf{#1:} #2}}
:END:


#+TITLE: Quantum Internet Alliance M4.2: List of atomic tasks
#+DATE:2020-02-24
#+AUTHOR: H. Ollivier

* Purpose
Application level protocols need to have access to networking services such as entanglement sharing between any two points of the network. While such service is at the heart of the quantum internet architecture, additionnal functionalities can be requiered or just convenient to have for better, faster, wider development of application level protocols. 

The purpose of this report is to review a wide range of such protocols searching for atomic repeatable functions while categorising them along several dimensions (such as their corresponding network stage). By doing so, we aim at providing building blocks that would: 
- lessen the amount of code and control needed while developing applications;
- allow benchmarking of the nodes and network capabilities against these tasks;
- provide functionalities with sound cryptographic definitions;
- provide a simulation platform where these functions would already be implemented, to further accelerate the creation cycle of a quantum protocols, as well as providing reusability of code.

* Methodology
1. Review of the entire quantum protocol zoo looking at each protocol;
2. Identification and grouping of  candidate atomic functions;
3. Categorising various candidates into network stages, type (quantum internet layer attribution, off-layer), and necessity
4. Integration into protocol zoo's knowledge graph

