atomic_tasks_report.tex
% Created 2020-02-24 Mon 00:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{color}
\usepackage{listings}
\usepackage{amsmath}
\usepackage{braket}
\usepackage{mathrsfs}
\usepackage{marginnote}
\newcommand{\mn}[2]{\marginnote{\tiny \textbf{#1:} #2}}
\author{H. Ollivier}
\date{2020-02-24}
\title{Quantum Internet Alliance M4.2: List of atomic tasks}
\hypersetup{
 pdfauthor={H. Ollivier},
 pdftitle={Quantum Internet Alliance M4.2: List of atomic tasks},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3.1)}, 
 pdflang={English}}
\begin{document}

\maketitle


\section{Purpose}
\label{sec:org2c57c5f}
Application level protocols need to have access to networking services such as entanglement sharing between any two points of the network. While such service is at the heart of the quantum internet architecture, additionnal functionalities can be requiered or just convenient to have for better, faster, wider development of application level protocols. 

The purpose of this report is to review a wide range of such protocols searching for atomic repeatable functions while categorising them along several dimensions (such as their corresponding network stage). By doing so, we aim at providing building blocks that would: 
\begin{itemize}
\item lessen the amount of code and control needed while developing applications;
\item allow benchmarking of the nodes and network capabilities against these tasks;
\item provide functionalities with sound cryptographic definitions;
\item provide a simulation platform where these functions would already be implemented, to further accelerate the creation cycle of a quantum protocols, as well as providing reusability of code.
\end{itemize}

\section{Methodology}
\label{sec:org6dd60d7}
\begin{enumerate}
\item Review of the entire quantum protocol zoo looking at each protocol;
\item Identification and grouping of  candidate atomic functions;
\item Categorising various candidates into network stages, type (quantum internet layer attribution, off-layer), and necessity
\item Integration into protocol zoo's knowledge graph
\end{enumerate}
