atomic_tasks_report.org
* Review of the quantum protocol zoo

| Protocol                                                         | Atomic Function Candidates                                                              |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| GHZ-based Quantum Anonymous Transmission                         | Classical authenticated channels                                                        |
| https://arxiv.org/abs/quant-ph/0409201                           | GHZ creation and broadcast                                                              |
|                                                                  | Classical collision detection protocol                                                  |
|                                                                  | Single qubit measurement                                                                |
|                                                                  | Single qubit Hadamard gate                                                              |
|                                                                  | Limited memory                                                                          |
|                                                                  | Teleportation                                                                           |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Verifiable Quantum Anonymous Transmission                        | Notification (private computation of classical parity, OR, Rand)                        |
| https://arxiv.org/pdf/1811.04729.pdf                             | Single qubit measurements in the equatorial plane                                       |
|                                                                  | Imperfect GHZ source                                                                    |
|                                                                  | Limited memory                                                                          |
|                                                                  | (Uses GHZ anonymous transmission as subroutine)                                         |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Polynomial Code based Quantum Authentication                     | Clifford circuits (error correction)                                                    |
| https://arxiv.org/pdf/quant-ph/0205128.pdf                       | Memory                                                                                  |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Fast Quantum Byzantine Agreement                                 | Distribution of GHZ state among n parties                                               |
| https://dl.acm.org/doi/10.1145/1060590.1060662                   | Verification of n-party maximally entangled state                                       |
|                                                                  | (Uses oblivious common coin)                                                            |
|                                                                  | (Uses verifiable QSS)                                                                   |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Quantum Bit Commitment                                           | BB84 encoding of classical information                                                  |
| https://arxiv.org/abs/1108.2879                                  | Single qubit measurement in computational and +/- bases                                 |
|                                                                  | Secure classical channel                                                                |
|                                                                  | Fast operations to keep the relativistic constraints                                    |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Quantum Coin Flipping                                            | $\pi/9$ single qubit preparation                                                        |
| https://arxiv.org/abs/quant-ph/9904078                           | Multi qubit POVM                                                                        |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Gottesman and Chuang Quantum Digital Signature                   | Memory                                                                                  |
| https://arxiv.org/abs/quant-ph/0105032                           | Swap test                                                                               |
|                                                                  | Stabilizer states creation                                                              |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Prepare and Measure Quantum Digital Signature (QDS)              | Quantum authenticated channel (unfortunately stronger than QDS)                         |
|                                                                  | BB84 encoding                                                                           |
|                                                                  | BB84 decoding                                                                           |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Measurement Device Independent QDS                               | Classical authenticated channels                                                        |
|                                                                  | Measurement Device Independent QKD link                                                 |
|                                                                  | BB8484 Encoding and Decoding                                                            |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Multipartite Entanglement Verification                           | Authenticated classical channels                                                        |
|                                                                  | Secure classical broadcast                                                              |
|                                                                  | Common shared randomness                                                                |
|                                                                  | Limited memory                                                                          |
|                                                                  | BB84 Measurements                                                                       |
|                                                                  | GHZ source / broadcast                                                                  |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Quantum Fingerprinting                                           | Clifford gates                                                                          |
|                                                                  | Swap test                                                                               |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| BB84                                                             | BB84 Encoding and Decoding                                                              |
|                                                                  | Authenticated classical channel                                                         |
|                                                                  | Privacy amplification                                                                   |
|                                                                  | Information reconciliation                                                              |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Device Independent QKD                                           | EPR distribution                                                                        |
|                                                                  | Information reconciliation                                                              |
|                                                                  |                                                                                         |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Quantum Leader Election                                          | (Uses Weak coin flipping)                                                               |
|                                                                  |                                                                                         |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Quantum Cheque                                                   | 1. Uses: QKD                                                                            |
|                                                                  | 2. GHZ source                                                                           |
|                                                                  | 3. Quantum memory                                                                       |
|                                                                  | 4. Quantum 1-way function                                                               |
|                                                                  | 5. SWAP test                                                                            |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Quantum Coin                                                     | Clifford gates                                                                          |
|                                                                  | Quantum memory                                                                          |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Quantum Token                                                    | BB84 Encoding and decoding                                                              |
|                                                                  | Quantum Memory                                                                          |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Wiesner Quantum Money                                            | BB84 Encoding and decoding                                                              |
|                                                                  | Quantum Memory                                                                          |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Quantum Oblivious transfer                                       | BB84 Encoding and decoding                                                              |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Classical FHE for q circuits                                     | TDO                                                                                     |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Measurement-Only Universal Blind Quantum Computation             | Graph state generation (C-Z, + states preparation, + quantum memory)                    |
|                                                                  | Equatorial plane measurements                                                           |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Prepare-and-Send Quantum Fully Homomorphic Encryption            | TDO                                                                                     |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Prepare-and-Send Universal Blind Quantum Computation             | Graph state generation (C-Z, + states preparation, + quantum memory)                    |
|                                                                  | Equatorial plane measurements                                                           |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Certified Pseudo-Secret Random Qubit Generator (PSQRG)           | BB84 Encoding Decoding                                                                  |
|                                                                  | Quantum Memory                                                                          |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Prepare-and-Send Verifiable Universal Blind Quantum Computation  | Graph state generation                                                                  |
|                                                                  | Equatorial plane measurement                                                            |
|                                                                  | Quantum One Time Pad                                                                    |
|                                                                  | Quantum memory (size depends on graph considered, do not need to store the whole graph) |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Measurement-Only Verifiable Universal Blind Quantum Computation  | Graph state generation (C-Z, + states preparation, + quantum memory)                    |
|                                                                  | Equatorial plane measurement                                                            |
|                                                                  | Quantum memory                                                                          |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Prepare-and-Send Verifiable Quantum Fully Homomorphic Encryption | TDO                                                                                     |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Secure Multiparty Delegated Quantum Computation                  | Graph state generation                                                                  |
|                                                                  | Verifiable secret sharing                                                               |
|                                                                  | TDO                                                                                     |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| State Teleportation                                              | EPR state source and broadcasting                                                       |
|                                                                  | Bell measurements                                                                       |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Weak String Erasure                                              | BB84 Encoding and Decoding                                                              |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|
| Certified Finite / Infinite Randomness Expansion                 | BB84 Encoding and Decoding                                                              |
|                                                                  | EPR generation between 2 measurement devices                                            |
|------------------------------------------------------------------+-----------------------------------------------------------------------------------------|



