atomic_tasks_report.tex

\section{Review of the quantum protocol zoo}
\label{sec:org3081bde}

\begin{center}
\begin{tabular}{ll}
Protocol & Atomic Function Candidates\\
\hline
GHZ-based Quantum Anonymous Transmission & Classical authenticated channels\\
\url{https://arxiv.org/abs/quant-ph/0409201} & GHZ creation and broadcast\\
 & Classical collision detection protocol\\
 & Single qubit measurement\\
 & Single qubit Hadamard gate\\
 & Limited memory\\
 & Teleportation\\
\hline
Verifiable Quantum Anonymous Transmission & Notification (private computation of classical parity, OR, Rand)\\
\url{https://arxiv.org/pdf/1811.04729.pdf} & Single qubit measurements in the equatorial plane\\
 & Imperfect GHZ source\\
 & Limited memory\\
 & (Uses GHZ anonymous transmission as subroutine)\\
\hline
Polynomial Code based Quantum Authentication & Clifford circuits (error correction)\\
\url{https://arxiv.org/pdf/quant-ph/0205128.pdf} & Memory\\
\hline
Fast Quantum Byzantine Agreement & Distribution of GHZ state among n parties\\
\url{https://dl.acm.org/doi/10.1145/1060590.1060662} & Verification of n-party maximally entangled state\\
 & (Uses oblivious common coin)\\
 & (Uses verifiable QSS)\\
\hline
Quantum Bit Commitment & BB84 encoding of classical information\\
\url{https://arxiv.org/abs/1108.2879} & Single qubit measurement in computational and +/- bases\\
 & Secure classical channel\\
 & Fast operations to keep the relativistic constraints\\
\hline
Quantum Coin Flipping & \(\pi/9\) single qubit preparation\\
\url{https://arxiv.org/abs/quant-ph/9904078} & Multi qubit POVM\\
\hline
Gottesman and Chuang Quantum Digital Signature & Memory\\
\url{https://arxiv.org/abs/quant-ph/0105032} & Swap test\\
 & Stabilizer states creation\\
\hline
Prepare and Measure Quantum Digital Signature (QDS) & Quantum authenticated channel (unfortunately stronger than QDS)\\
 & BB84 encoding\\
 & BB84 decoding\\
\hline
Measurement Device Independent QDS & Classical authenticated channels\\
 & Measurement Device Independent QKD link\\
 & BB8484 Encoding and Decoding\\
\hline
Multipartite Entanglement Verification & Authenticated classical channels\\
 & Secure classical broadcast\\
 & Common shared randomness\\
 & Limited memory\\
 & BB84 Measurements\\
 & GHZ source / broadcast\\
\hline
Quantum Fingerprinting & Clifford gates\\
 & Swap test\\
\hline
BB84 & BB84 Encoding and Decoding\\
 & Authenticated classical channel\\
 & Privacy amplification\\
 & Information reconciliation\\
\hline
Device Independent QKD & EPR distribution\\
 & Information reconciliation\\
 & \\
\hline
Quantum Leader Election & (Uses Weak coin flipping)\\
 & \\
\hline
Quantum Cheque & 1. Uses: QKD\\
 & 2. GHZ source\\
 & 3. Quantum memory\\
 & 4. Quantum 1-way function\\
 & 5. SWAP test\\
\hline
Quantum Coin & Clifford gates\\
 & Quantum memory\\
\hline
Quantum Token & BB84 Encoding and decoding\\
 & Quantum Memory\\
\hline
Wiesner Quantum Money & BB84 Encoding and decoding\\
 & Quantum Memory\\
\hline
Quantum Oblivious transfer & BB84 Encoding and decoding\\
\hline
Classical FHE for q circuits & TDO\\
\hline
Measurement-Only Universal Blind Quantum Computation & Graph state generation (C-Z, + states preparation, + quantum memory)\\
 & Equatorial plane measurements\\
\hline
Prepare-and-Send Quantum Fully Homomorphic Encryption & TDO\\
\hline
Prepare-and-Send Universal Blind Quantum Computation & Graph state generation (C-Z, + states preparation, + quantum memory)\\
 & Equatorial plane measurements\\
\hline
Certified Pseudo-Secret Random Qubit Generator (PSQRG) & BB84 Encoding Decoding\\
 & Quantum Memory\\
\hline
Prepare-and-Send Verifiable Universal Blind Quantum Computation & Graph state generation\\
 & Equatorial plane measurement\\
 & Quantum One Time Pad\\
 & Quantum memory (size depends on graph considered, do not need to store the whole graph)\\
\hline
Measurement-Only Verifiable Universal Blind Quantum Computation & Graph state generation (C-Z, + states preparation, + quantum memory)\\
 & Equatorial plane measurement\\
 & Quantum memory\\
\hline
Prepare-and-Send Verifiable Quantum Fully Homomorphic Encryption & TDO\\
\hline
Secure Multiparty Delegated Quantum Computation & Graph state generation\\
 & Verifiable secret sharing\\
 & TDO\\
\hline
State Teleportation & EPR state source and broadcasting\\
 & Bell measurements\\
\hline
Weak String Erasure & BB84 Encoding and Decoding\\
\hline
Certified Finite / Infinite Randomness Expansion & BB84 Encoding and Decoding\\
 & EPR generation between 2 measurement devices\\
\hline
\end{tabular}
\end{center}
