atomic_tasks_report.org
* Task extraction and categorisation

| Function                                                            | Layer               | TNetwork stage | Comment |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Sending qubit                                                       | Transport / Session |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Sending qubit blocks                                                | Transport / Session |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| BB84 Encoding                                                       | Presentation        |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| BB84 Decoding                                                       | Presentation        |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Quantum One Time Pad / confidential channel (encoding and decoding) | Session             |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Classical authenticated channel                                     | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Creation and braodcast of GHZ state                                 | Network             |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Creation and broadcast of any stabilizer state                      | Network             |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Creation and broadcast of arbitrary graph states                    | Network             |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Single Qubit Measurement in equatorial plane                        | Presentation        |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Local Pauli gates                                                   | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Local Clifford gates                                                | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Local memory                                                        | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Non Cliffort gates                                                  | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Anonymous transmission channel                                      | Transport / Session |                | Keep?   |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Teleportation protocol                                              | Transport           |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Verification of stabilizer state                                    | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| (V)QSS                                                              | Off                 |                | Keep?   |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Quatum authenticated channel                                        | Transport / Session |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| QFactory                                                            | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Equatorial states preparation (local) arbitrary angle or given set  | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Swap Test                                                           | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Multi qubit POVM                                                    | Presentation        |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Privacy amplification                                               | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Information reconciliation                                          | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Secure classical broadcast channel                                  | Tranport / Session  |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Common Shared Randomness                                            | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Weak Coin Flipping                                                  | Application         |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|
| Quantum 1 way function                                              | Off                 |                |         |
|---------------------------------------------------------------------+---------------------+----------------+---------|


* KG
* Software implementation recommendations
* Hardware integration recommendations

