atomic_tasks_report.tex



\section{Task extraction and categorisation}
\label{sec:org608ac1a}

\begin{center}
\begin{tabular}{llll}
Function & Layer & TNetwork stage & Comment\\
\hline
Sending qubit & Transport / Session &  & \\
\hline
Sending qubit blocks & Transport / Session &  & \\
\hline
BB84 Encoding & Presentation &  & \\
\hline
BB84 Decoding & Presentation &  & \\
\hline
Quantum One Time Pad / confidential channel (encoding and decoding) & Session &  & \\
\hline
Classical authenticated channel & Off &  & \\
\hline
Creation and braodcast of GHZ state & Network &  & \\
\hline
Creation and broadcast of any stabilizer state & Network &  & \\
\hline
Creation and broadcast of arbitrary graph states & Network &  & \\
\hline
Single Qubit Measurement in equatorial plane & Presentation &  & \\
\hline
Local Pauli gates & Off &  & \\
\hline
Local Clifford gates & Off &  & \\
\hline
Local memory & Off &  & \\
\hline
Non Cliffort gates & Off &  & \\
\hline
Anonymous transmission channel & Transport / Session &  & Keep?\\
\hline
Teleportation protocol & Transport &  & \\
\hline
Verification of stabilizer state & Off &  & \\
\hline
(V)QSS & Off &  & Keep?\\
\hline
Quatum authenticated channel & Transport / Session &  & \\
\hline
QFactory & Off &  & \\
\hline
Equatorial states preparation (local) arbitrary angle or given set & Off &  & \\
\hline
Swap Test & Off &  & \\
\hline
Multi qubit POVM & Presentation &  & \\
\hline
Privacy amplification & Off &  & \\
\hline
Information reconciliation & Off &  & \\
\hline
Secure classical broadcast channel & Tranport / Session &  & \\
\hline
Common Shared Randomness & Off &  & \\
\hline
Weak Coin Flipping & Application &  & \\
\hline
Quantum 1 way function & Off &  & \\
\hline
\end{tabular}
\end{center}


\section{KG}
\label{sec:org9b2ab16}
\section{Software implementation recommendations}
\label{sec:org09455ed}
\section{Hardware integration recommendations}
\label{sec:org2f6b776}
\end{document}
